app/views/recipes/_ingredient_fields.html.erb

SELECT "ingredients".* FROM "ingredients"
SELECT "quantities".* FROM "quantities"
SELECT "measurements".* FROM "measurements"
---
      <%= puts "louis randall the params for the ingredients from the edit side: #{params.inspect}" %>
      <%= select_tag 'Ingredient', options_for_select(Ingredient.all.collect{ |u| [u.name, u.id.to_s]}), include_blank: true, multiple: true %>
      <%= select_tag 'Quantity', options_for_select(Quantity.all.collect{ |u| [u.amount, u.id.to_s]}), include_blank: true, multiple: true %>
      <%= select_tag 'Measurement', options_for_select(Measurement.all.collect{ |u| [u.name, u.id.to_s]}), include_blank: true, multiple: true %>