app/views/recipes/_instruction_fields.html.erb

SELECT "instructions".* FROM "instructions"
---
      <%= f.label "Instruction name and order" %>
      <%= select_tag 'Instruction', options_for_select(Instruction.all.collect{ |u| [u.short_hand_name, u.id.to_s]}), include_blank: true, multiple: true %>