app/views/recipes/show.html.erb


    <% @recipe.recipe_ingredients.each do |recipe_ingredient| %>
---
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 99]]


    <% @recipe.recipe_instructions.each do |recipe_instruction| %>
---
SELECT "recipe_instructions".* FROM "recipe_instructions" WHERE "recipe_instructions"."recipe_id" = $1  [["recipe_id", 99]]