app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    puts "LOUIS RANDAAL - SO WE'RE GOING THROUGH THIS THING"
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save