app/controllers/instructions_controller.rb

  def index
    @instructions = Instruction.all
---
SELECT "instructions".* FROM "instructions"

  def create
    @instruction = Instruction.new(instruction_params)

    respond_to do |format|
      if @instruction.save
---
INSERT INTO "instructions" ("short_hand_name", "description", "time_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_hand_name", "spread jam"], ["description", "spread the jam on the bread"], ["time_amount", 5], ["created_at", "2021-09-05 00:57:04.834889"], ["updated_at", "2021-09-05 00:57:04.834889"]]

    def set_instruction
      @instruction = Instruction.find(params[:id])
---
SELECT  "instructions".* FROM "instructions" WHERE "instructions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]