app/controllers/measurements_controller.rb

  def index
    @measurements = Measurement.all
---
SELECT "measurements".* FROM "measurements"