app/controllers/quantities_controller.rb

  def index
    @quantities = Quantity.all
---
SELECT "quantities".* FROM "quantities"

  def create
    @quantity = Quantity.new(quantity_params)

    respond_to do |format|
      if @quantity.save
---
INSERT INTO "quantities" ("amount", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["amount", "0.0"], ["created_at", "2021-07-24 21:04:15.992387"], ["updated_at", "2021-07-24 21:04:15.992387"]]

    def set_quantity
      @quantity = Quantity.find(params[:id])
---
SELECT  "quantities".* FROM "quantities" WHERE "quantities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]