app/controllers/recipes_controller.rb

  def create
    puts "LOUIS RANDALL THE PARAMS FIRST IN CREATE ARE: #{recipe_params.inspect}"
    puts "LOUIS RANDALL THE INSTRUCTIONS: #{params["Instruction"]}"

    instruction_params = {}
    ingredient_params = {}
    updated_params = recipe_params
    puts "louis randall the updated_params first look: #{updated_params.inspect}"
    puts "louis randall the updated_params first look new instructions: #{updated_params["New Instructions"]}"

    if params["Ingredient"].present?
      params["Ingredient"].each_with_index do |id, index|
        ingredient_params[id] = [id, params["Quantity"][index].to_d, params["Measurement"][index]]
      end
    end

    if params["Instruction"].present?
---
SELECT "ingredients".* FROM "ingredients"
SELECT  "instructions".* FROM "instructions" ORDER BY "instructions"."id" ASC LIMIT $1  [["LIMIT", 1]]


    puts "LOUIS RANDALL THE RECIPE: #{@recipe.inspect}"
    respond_to do |format|
      if @recipe.save! && recipe_ingredient_creation(@recipe, ingredient_params) && recipe_instruction_creation(@recipe,instruction_params ) && create_new_instructions(@recipe, instructions_attributes)
---
INSERT INTO "ingredients" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-09-03 20:59:55.685716"], ["updated_at", "2021-09-03 20:59:55.685716"]]
INSERT INTO "instructions" ("short_hand_name", "description", "time_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_hand_name", "asvsavd"], ["description", "svsdv"], ["time_amount", 4], ["created_at", "2021-09-05 04:39:45.874566"], ["updated_at", "2021-09-05 04:39:45.874566"]]
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "measurement_id", "quantity_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 66], ["ingredient_id", 3], ["measurement_id", 2], ["quantity_id", 2]]
INSERT INTO "recipe_instructions" ("recipe_id", "instruction_id", "order") VALUES ($1, $2, $3) RETURNING "id"  [["recipe_id", 79], ["instruction_id", 1], ["order", 2]]

  def recipe_ingredient_creation(recipe, ingredient_params)
    ingredient_params.each do |key, value|
      puts "LOUIS RANDALL VALUE: #{value.inspect}"
      recipe.recipe_ingredients.find_or_create_by(ingredient_id: value[0], quantity_id:value[1], measurement_id: value[2])
---
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "measurement_id", "quantity_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 99], ["ingredient_id", 1], ["measurement_id", 1], ["quantity_id", 1]]
SELECT  "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1 AND "recipe_ingredients"."ingredient_id" = $2 AND "recipe_ingredients"."quantity_id" = $3 AND "recipe_ingredients"."measurement_id" = $4 LIMIT $5  [["recipe_id", 99], ["ingredient_id", 1], ["quantity_id", 1], ["measurement_id", 1], ["LIMIT", 1]]

  def recipe_instruction_creation(recipe, instruction_params)
    puts "LOUIS RANDALL instruction_params: #{instruction_params}"
    instruction_params.each do |key, value|
      puts "LOUIS RANDALL THE VALUE "
      recipe.recipe_instructions.find_or_create_by(instruction_id: value[0], order: value[1])
---
INSERT INTO "recipe_instructions" ("recipe_id", "instruction_id", "order") VALUES ($1, $2, $3) RETURNING "id"  [["recipe_id", 99], ["instruction_id", 1], ["order", 1]]
SELECT  "recipe_instructions".* FROM "recipe_instructions" WHERE "recipe_instructions"."recipe_id" = $1 AND "recipe_instructions"."instruction_id" = $2 AND "recipe_instructions"."order" = $3 LIMIT $4  [["recipe_id", 99], ["instruction_id", 1], ["order", 1], ["LIMIT", 1]]

  def create_new_instructions(recipe, instructions_attributes)
    recipe = recipe
    puts "LOUIS RANDALL TEH create_new_instructions: #{instructions_attributes}"
    instructions_attributes.each do |k, v|
      attr = v
      attr["time_amount"] = v["time_amount"].to_i
      puts "LOUIS RANDALL TEH V: #{v.inspect}"
      puts "LOUIS RANDALL TEH V: #{v.inspect}"

      instruction = Instruction.new(short_hand_name: attr["short_hand_name"], description: attr["description"], time_amount: attr["time_amount"])
      recipe.recipe_instructions.find_or_create_by(instruction: instruction, order: attr["order"])
---
INSERT INTO "instructions" ("short_hand_name", "description", "time_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["short_hand_name", "fdbdsbbd"], ["description", "sdbdfb"], ["time_amount", 1], ["created_at", "2021-09-05 04:53:03.038573"], ["updated_at", "2021-09-05 04:53:03.038573"]]
INSERT INTO "recipe_instructions" ("recipe_id", "instruction_id", "order") VALUES ($1, $2, $3) RETURNING "id"  [["recipe_id", 98], ["instruction_id", 7], ["order", 10]]
SELECT  "recipe_instructions".* FROM "recipe_instructions" WHERE "recipe_instructions"."recipe_id" = $1 AND "recipe_instructions"."instruction_id" IS NULL AND "recipe_instructions"."order" = $2 LIMIT $3  [["recipe_id", 98], ["order", 10], ["LIMIT", 1]]